Revit 2025 API
IFCLogical Enumeration
 A datatype can have values TRUE, FALSE, UNKNOWN or UNSET.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum IFCLogical
Public Enumeration IFCLogical
public enum class IFCLogical
type IFCLogical
Members
Member name | Value | Description
False | 0 |  False.
Unknown | 1 |  Unknown.
True | 2 |  True.
Unset | 3 |  Unset.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace